import Register from "../features/auth/Register";
import { Link, NavLink, useNavigate } from 'react-router-dom';


const HomePage = () => {  
    return(
        <>
   <p>ניגוד לכסף הניתן מקופת הצדקה שאינו מיועד להשבה, הכסף הניתן כהלוואה לנצרך נדרש להשבה על ידי המקבל כעבור זמן קבוע. על מנת לוודא כי הכסף היוצא מקופת הגמ"ח אכן ישוב אליה, מופעלים כללים שונים על ידי מפעילי קופת הגמ"ח, כדוגמת דרישה להצגת ביטחונות, תלושי משכורת וערבים בעלי יכולת החזר, וכאשר הלווה משתמט מהחזר החוב ישנה אפשרות להפעלת גובי חובות והוצאה לפועל, והפעלת סנקציות שונות כדוגמת סירוב לבקשת הלוואה עתידית. החזר ההלוואה נעשה על פי רוב באמצעות המחאה בנקאית והוראות קבע, ובאופן מצומצם על ידי מזומן ואשראי.

הקרן המשמשת כבסיס לפעילות הגמ"ח מתבססת על תרומות ועזבונות נפטרים המוקדשים לגמ"ח, לצד פיקדונות הניתנים לתקופה מוגבלת על ידי אנשים פרטיים, מתוך רצון שכספם ישמש להלוואות לנצרכים.

מרבית קופות הגמ"ח פועלות על ידי מתנדבים, העוסקים בהפעלה המנהלית והבנקאית של הגמ"ח בביתם הפרטי או במבנה ציבורי, ומיעוטן (בייחוד גמ"חים הפועלים בהיקפים גדולים) מעסיקים מספר מצומצם של עובדי מנהלה, ומחזיקים במשרד.

להלוואה הניתנת על ידי הגמ"ח לא מתווספת ריבית בעקבות איסור התורה, אך בתקופות שבהן חל פיחות בשער המטבע או אינפלציה בשיעור גבוה (דבר שאיים על קיום הקרן של קופת הגמ"ח, למשל במהלך שנות ה־80 של המאה ה־20), החלו דיונים בשאלה האם מותר להצמיד את ההלוואה למדד המחירים לצרכן. בחלק מהמקרים נתנו הלוואות כשהם צמודות לשער הדולר, על מנת להגן על הקרן של קופת הגמ"ח. עם התייצבות האינפלציה שבו מרבית ההלוואות להינתן בשקלים.

במקרים שונים פסקה פעולתן של קופות גמ"ח שונות עקב ריבוי חובות שלא הושבו באופן ששחק את הקרן של קופת הגמ"ח, או עקב אינפלציה משמעותית והיעדר הצמדה למדד המחירים לצרכן או למטבע זר.

חלק מקופות הגמ"ח מתנהלות באופן עמום וחשאי-למחצה וללא פרסום גלוי, כאשר לווים מגיעים לבקשת הלוואה בעקבות המלצות הניתנות ממכרים. חלק ממפעילי קופות הגמ"ח נימקו צורת פעילות זו בחשש מגניבות (בייחוד כאשר הלוואות ניתנות ומושבות במזומן, ולא דרך המחאות ובנקים), ובניסיון למנוע פגיעה בקרן קופת הגמ"ח מלווים בעייתיים שלא ישיבו את ההלוואה. מנגד, חלק מקופות הגמ"ח פועלות כעמותות, מלוות בבקרה של רואה חשבון ומפרסמות דו"ח שנתי על פעילותן והמחזור הכספי שלהן.

נוהג הקיים לעיתים לצד מוסד הגמ"ח הוא 'גלגול גמ"חים', שמשמעו קבלת הלוואה מגמ"ח מסוים על מנת להשיב סכום עבור גמ"ח אחר, וחוזר חלילה.</p>  
       </>
    )
}
export default HomePage;
